[
  {
    "name": "Vasanth Samuel Raj",
    "designation": "Senior Team Leader at Adela Software and Services Pvt. Ltd",
    "date": "March 20, 2018",
    "text":
      "Jerry was a wonderful resource with good technical skills and a great team player. Always spot on to achieve the Team's targets and needs. A key resource missed by our organization and myself. An asset which I wish I could retain."
  },
  {
    "name": "Priti Priyadarshi",
    "designation": "HR",
    "date": "March 14, 2018",
    "text":
      "Jerry is a very hardworking dedicated professional and a great human being to work with. An excellent resource for a team. He is a great motivator not just for his team but for everyone on the location. His knowledge and experience is the thing anyone can count upon."
  },
  {
    "name": "Wissam Mohsen, ITIL V3, MCP, MCTS",
    "designation": "System Analyst",
    "date": "March 14, 2018",
    "text":
      "Extreme helpful Co-Worker! organized and helping team to grow and he have very friendly attittude<br><br>Jerry is an big added value for any team he never stop updating himself and he is a reference in front end development\r\n\r\nI have seen him for a year of work cabable of handling complex developments\r\n\r\nI strongly recommending him in well structured development companies"
  },
  {
    "name": "Atishay Goyal",
    "designation":
      "UX & Product Designer | Design Thinking Enthusiast | atishay.design",
    "date": "March 13, 2018",
    "text":
      "I worked with Jerry on a project in Abu Dhabi for about a year. He was a core member of the project and an expert in replicating my designs into a fully functional feature.\r\n\r\nI have seen Jerry go above and beyond the expectations just to keep up with his committed timelines. His interest in the business aspect of the project, ability to think before implementation and build something useful for the users sets him apart from the crowd.\r\n\r\nHe is utmost keen on learning new tech-stacks and is always available to his peers for any guidance they might need. He is a great colleague, an amazing friend and a shining asset to any company."
  },
  {
    "name": "Raghavan Ravi",
    "designation": "UI/UX Web Developer at Torry Harris Business Solutions",
    "date": "March 11, 2018",
    "text":
      "A highly skilled Developer, had the pleasure of working with him on a project. His expertise in JS frameworks gave me an opportunity to learn various skills under his wing which includes AngularJS. Thanks and keep on the good work."
  },
  {
    "name": "Abhinav Saxena",
    "designation": "Sr. Consultant at Xebia",
    "date": "March 9, 2018",
    "text":
      "It was a pleasure of working with Jerry for the past 2 plus years. During this time, we worked together on multiple enterprise web applications. Jerry is a person with a strong ownership and driving for results all the time. He sees and can address everything from the big picture to the details. Jerry is creative, energetic, solutions oriented and highly motivated with great communication skills. He is an asset to any company that he’s with."
  }
]
